GCI/fine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// FDA Nozzle Benchmark - Case 1 (Re = 500, Laminar)
// Phase 2: Parabolic inlet profile for fully-developed laminar flow
//
// Poiseuille equation: U(r) = 2 * U_avg * (1 - r²/R²)
// U_avg = 0.04604 m/s (from Q = 5.20624e-6 m³/s)
// R = 0.006 m (inlet radius)
// Peak velocity at centerline: U_max = 2 * U_avg = 0.09208 m/s

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.04604);

boundaryField
{
    inlet
    {
        // Parabolic velocity profile using expression-based BC
        // U(r) = 2 * Uavg * max(1 - r²/R², 0)
        // where r² = x² + y² and R = 0.006 m
        type            exprFixedValue;
        valueExpr       "vector(0, 0, 0.09208 * max(1 - (pos().x()*pos().x() + pos().y()*pos().y()) / 0.000036, 0))";
        value           uniform (0 0 0.04604);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    wallInlet
    {
        type            noSlip;
    }
    
    wallCollector
    {
        type            noSlip;
    }
    
    wallThroat
    {
        type            noSlip;
    }
    
    wallOutlet
    {
        type            noSlip;
    }
    
    stepExpansion
    {
        type            noSlip;
    }
}

// ************************************************************************* //
